espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of dpc_conf register
 *  DPC parameter config register
 */
typedef union {
    struct {
        /** dpc_threshold_l : R/W; bitpos: [7:0]; default: 48;
         *  this bit configures the threshold to detect black img in check mode, or the low
         *  threshold(use 8 bit 0~255) in dyn method 0, or the low threshold factor (use 5 bit
         *  10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1
         */
        uint32_t dpc_threshold_l:8;
        /** dpc_threshold_h : R/W; bitpos: [15:8]; default: 48;
         *  this bit configures the threshold to detect white img in check mode, or the high
         *  threshold(use 8 bit 0~255) in dyn method 0, or the high threshold factor (use 5 bit
         *  10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1
         */
        uint32_t dpc_threshold_h:8;
        /** dpc_factor_dark : R/W; bitpos: [21:16]; default: 16;
         *  this field configures the dynamic correction method 1 dark   factor
         */
        uint32_t dpc_factor_dark:6;
        /** dpc_factor_brig : R/W; bitpos: [27:22]; default: 16;
         *  this field configures the dynamic correction method 1 bright factor
         */
        uint32_t dpc_factor_brig:6;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_dpc_conf_reg_t;

/** Type of dpc_matrix_ctrl register
 *  dpc pix2matrix ctrl
 */
typedef union {
    struct {
        /** dpc_tail_pixen_pulse_tl : R/W; bitpos: [7:0]; default: 0;
         *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
         *  next frame, only reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0
         *  and reg_dpc_tail_pixen_pulse_th < reg_dpc_tail_pixen_pulse_tl will enable tail
         *  pulse function
         */
        uint32_t dpc_tail_pixen_pulse_tl:8;
        /** dpc_tail_pixen_pulse_th : R/W; bitpos: [15:8]; default: 0;
         *  matrix tail pixen high level threshold, must < hnum-1, only
         *  reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0 and
         *  reg_dpc_tail_pixen_pulse_th < reg_dpc_tail_pixen_pulse_tl will enable tail pulse
         *  function
         */
        uint32_t dpc_tail_pixen_pulse_th:8;
        /** dpc_padding_data : R/W; bitpos: [23:16]; default: 0;
         *  this field configures dpc matrix padding data
         */
        uint32_t dpc_padding_data:8;
        /** dpc_padding_mode : R/W; bitpos: [24]; default: 0;
         *  this bit configures the padding mode of dpc matrix.  0: use pixel in image to do
         *  padding   1: use reg_padding_data to do padding
         */
        uint32_t dpc_padding_mode:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_dpc_matrix_ctrl_reg_t;

/** Type of lut_cmd register
 *  LUT command register
 */
typedef union {
    struct {
        /** lut_addr : WT; bitpos: [11:0]; default: 0;
         *  this field configures the lut access addr, when select lsc lut, [11:10]:00 sel gb_b
         *  lut, 01 sel r_gr lut
         */
        uint32_t lut_addr:12;
        /** lut_num : WT; bitpos: [15:12]; default: 0;
         *  this field configures the lut selection. 0000:LSC LUT 0001:DPC LUT
         */
        uint32_t lut_num:4;
        /** lut_cmd : WT; bitpos: [16]; default: 0;
         *  this bit configures the access event of lut. 0:rd 1: wr
         */
        uint32_t lut_cmd:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_lut_cmd_reg_t;

/** Type of lut_wdata register
 *  LUT write data register
 */
typedef union {
    struct {
        /** lut_wdata : R/W; bitpos: [31:0]; default: 0;
         *  this field configures the write data of lut. please initial ISP_LUT_WDATA before
         *  write ISP_LUT_CMD register
         */
        uint32_t lut_wdata:32;
    };
    uint32_t val;
} isp_lut_wdata_reg_t;

/** Type of lsc_tablesize register
 *  LSC point in x-direction
 */
typedef union {
    struct {
        /** lsc_xtablesize : R/W; bitpos: [4:0]; default: 31;
         *  this field configures lsc table size in x-direction
         */
        uint32_t lsc_xtablesize:5;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} isp_lsc_tablesize_reg_t;

/** Type of demosaic_matrix_ctrl register
 *  demosaic pix2matrix ctrl
 */
typedef union {
    struct {
        /** demosaic_tail_pixen_pulse_tl : R/W; bitpos: [7:0]; default: 0;
         *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
         *  next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and
         *  reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th <
         *  reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function
         */
        uint32_t demosaic_tail_pixen_pulse_tl:8;
        /** demosaic_tail_pixen_pulse_th : R/W; bitpos: [15:8]; default: 0;
         *  matrix tail pixen high level threshold, must < hnum-1, only
         *  reg_demosaic_tail_pixen_pulse_th!=0 and reg_demosaic_tail_pixen_pulse_tl!=0 and
         *  reg_demosaic_tail_pixen_pulse_th < reg_demosaic_tail_pixen_pulse_tl will enable
         *  tail pulse function
         */
        uint32_t demosaic_tail_pixen_pulse_th:8;
        /** demosaic_padding_data : R/W; bitpos: [23:16]; default: 0;
         *  this field configures demosaic matrix padding data
         */
        uint32_t demosaic_padding_data:8;
        /** demosaic_padding_mode : R/W; bitpos: [24]; default: 0;
         *  this bit configures the padding mode of demosaic matrix.  0: use pixel in image to
         *  do padding   1: use reg_padding_data to do padding
         */
        uint32_t demosaic_padding_mode:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_demosaic_matrix_ctrl_reg_t;

/** Type of demosaic_grad_ratio register
 *  demosaic gradient select ratio
 */
typedef union {
    struct {
        /** demosaic_grad_ratio : R/W; bitpos: [5:0]; default: 16;
         *  this field configures demosaic gradient select ratio
         */
        uint32_t demosaic_grad_ratio:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} isp_demosaic_grad_ratio_reg_t;

/** Type of median_matrix_ctrl register
 *  median pix2matrix ctrl
 */
typedef union {
    struct {
        /** median_padding_data : R/W; bitpos: [7:0]; default: 0;
         *  this field configures median matrix padding data
         */
        uint32_t median_padding_data:8;
        /** median_padding_mode : R/W; bitpos: [8]; default: 0;
         *  this bit configures the padding mode of median matrix.  0: use pixel in image to do
         *  padding   1: use reg_padding_data to do padding
         */
        uint32_t median_padding_mode:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} isp_median_matrix_ctrl_reg_t;

/** Type of gamma_ctrl register
 *  gamma control register
 */
typedef union {
    struct {
        /** gamma_update : R/W; bitpos: [0]; default: 0;
         *  Indicates that gamma register configuration is complete
         */
        uint32_t gamma_update:1;
        /** gamma_b_last_correct : R/W; bitpos: [1]; default: 1;
         *  this bit configures enable of last b segment correcction. 0: disable, 1: enable
         */
        uint32_t gamma_b_last_correct:1;
        /** gamma_g_last_correct : R/W; bitpos: [2]; default: 1;
         *  this bit configures enable of last g segment correcction. 0: disable, 1: enable
         */
        uint32_t gamma_g_last_correct:1;
        /** gamma_r_last_correct : R/W; bitpos: [3]; default: 1;
         *  this bit configures enable of last r segment correcction. 0: disable, 1: enable
         */
        uint32_t gamma_r_last_correct:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} isp_gamma_ctrl_reg_t;

/** Type of gamma_y1 register
 *  point of Y-axis of r/g/b channel gamma curve register 1
 */
typedef union {
    struct {
        /** gamma_y03 : R/W; bitpos: [7:0]; default: 64;
         *  this field configures the point 3 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y03:8;
        /** gamma_y02 : R/W; bitpos: [15:8]; default: 48;
         *  this field configures the point 2 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y02:8;
        /** gamma_y01 : R/W; bitpos: [23:16]; default: 32;
         *  this field configures the point 1 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y01:8;
        /** gamma_y00 : R/W; bitpos: [31:24]; default: 16;
         *  this field configures the point 0 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y00:8;
    };
    uint32_t val;
} isp_gamma_y1_reg_t;

/** Type of gamma_y2 register
 *  point of Y-axis of r/g/b channel gamma curve register 2
 */
typedef union {
    struct {
        /** gamma_y07 : R/W; bitpos: [7:0]; default: 128;
         *  this field configures the point 7 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y07:8;
        /** gamma_y06 : R/W; bitpos: [15:8]; default: 112;
         *  this field configures the point 6 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y06:8;
        /** gamma_y05 : R/W; bitpos: [23:16]; default: 96;
         *  this field configures the point 5 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y05:8;
        /** gamma_y04 : R/W; bitpos: [31:24]; default: 80;
         *  this field configures the point 4 of Y-axis of r/g/b channel gamma curve
         */
        uint32_t gamma_y04:8;
    };
    uint32_t val;
} isp_gamma_y2_reg_t;

