espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of ae_ctrl register
 *  ae control register
 */
typedef union {
    struct {
        /** ae_update : WT; bitpos: [0]; default: 0;
         *  write 1 to this bit triggers one statistic event
         */
        uint32_t ae_update:1;
        /** ae_select : R/W; bitpos: [1]; default: 0;
         *  this field configures ae input data source, 0: data from median, 1: data from gama
         */
        uint32_t ae_select:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_ae_ctrl_reg_t;

/** Type of ae_monitor register
 *  ae monitor control register
 */
typedef union {
    struct {
        /** ae_monitor_tl : R/W; bitpos: [7:0]; default: 0;
         *  this field configures the lower lum threshold of ae monitor
         */
        uint32_t ae_monitor_tl:8;
        /** ae_monitor_th : R/W; bitpos: [15:8]; default: 0;
         *  this field configures the higher lum threshold of ae monitor
         */
        uint32_t ae_monitor_th:8;
        /** ae_monitor_period : R/W; bitpos: [21:16]; default: 0;
         *  this field configures ae monitor frame period
         */
        uint32_t ae_monitor_period:6;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_monitor_reg_t;

/** Type of ae_bx register
 *  ae window register in x-direction
 */
typedef union {
    struct {
        /** ae_x_bsize : R/W; bitpos: [10:0]; default: 384;
         *  this field configures every block x size
         */
        uint32_t ae_x_bsize:11;
        /** ae_x_start : R/W; bitpos: [21:11]; default: 0;
         *  this field configures first block start x address
         */
        uint32_t ae_x_start:11;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_bx_reg_t;

/** Type of ae_by register
 *  ae window register in y-direction
 */
typedef union {
    struct {
        /** ae_y_bsize : R/W; bitpos: [10:0]; default: 216;
         *  this field configures every block y size
         */
        uint32_t ae_y_bsize:11;
        /** ae_y_start : R/W; bitpos: [21:11]; default: 0;
         *  this field configures first block start y address
         */
        uint32_t ae_y_start:11;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_ae_by_reg_t;

/** Type of ae_winpixnum register
 *  ae sub-window pix num register
 */
typedef union {
    struct {
        /** ae_subwin_pixnum : R/W; bitpos: [16:0]; default: 82944;
         *  this field configures the pixel number of each sub win
         */
        uint32_t ae_subwin_pixnum:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_ae_winpixnum_reg_t;

/** Type of ae_win_reciprocal register
 *  reciprocal of ae sub-window pixel number
 */
typedef union {
    struct {
        /** ae_subwin_recip : R/W; bitpos: [19:0]; default: 0;
         *  this field configures the reciprocal of each subwin_pixnum, 20bit fraction
         */
        uint32_t ae_subwin_recip:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} isp_ae_win_reciprocal_reg_t;

/** Type of sharp_ctrl0 register
 *  sharp control register 0
 */
typedef union {
    struct {
        /** sharp_threshold_low : R/W; bitpos: [7:0]; default: 0;
         *  this field configures sharpen threshold for detail
         */
        uint32_t sharp_threshold_low:8;
        /** sharp_threshold_high : R/W; bitpos: [15:8]; default: 0;
         *  this field configures sharpen threshold for edge
         */
        uint32_t sharp_threshold_high:8;
        /** sharp_amount_low : R/W; bitpos: [23:16]; default: 0;
         *  this field configures sharpen amount for detail
         */
        uint32_t sharp_amount_low:8;
        /** sharp_amount_high : R/W; bitpos: [31:24]; default: 0;
         *  this field configures sharpen amount for edge
         */
        uint32_t sharp_amount_high:8;
    };
    uint32_t val;
} isp_sharp_ctrl0_reg_t;

/** Type of sharp_filter0 register
 *  sharp usm config register 0
 */
typedef union {
    struct {
        /** sharp_filter_coe00 : R/W; bitpos: [4:0]; default: 1;
         *  this field configures unsharp masking(usm) filter coefficient
         */
        uint32_t sharp_filter_coe00:5;
        /** sharp_filter_coe01 : R/W; bitpos: [9:5]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe01:5;
        /** sharp_filter_coe02 : R/W; bitpos: [14:10]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe02:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter0_reg_t;

/** Type of sharp_filter1 register
 *  sharp usm config register 1
 */
typedef union {
    struct {
        /** sharp_filter_coe10 : R/W; bitpos: [4:0]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe10:5;
        /** sharp_filter_coe11 : R/W; bitpos: [9:5]; default: 4;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe11:5;
        /** sharp_filter_coe12 : R/W; bitpos: [14:10]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe12:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter1_reg_t;

/** Type of sharp_filter2 register
 *  sharp usm config register 2
 */
typedef union {
    struct {
        /** sharp_filter_coe20 : R/W; bitpos: [4:0]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe20:5;
        /** sharp_filter_coe21 : R/W; bitpos: [9:5]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe21:5;
        /** sharp_filter_coe22 : R/W; bitpos: [14:10]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe22:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter2_reg_t;

typedef union {
    struct {
        /** sharp_filter_coe0 : R/W; bitpos: [4:0]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe0:5;
        /** sharp_filter_coe1 : R/W; bitpos: [9:5]; default: 2;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe1:5;
        /** sharp_filter_coe2 : R/W; bitpos: [14:10]; default: 1;
         *  this field configures usm filter coefficient
         */
        uint32_t sharp_filter_coe2:5;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_sharp_filter_reg_t;

