espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of sharp_matrix_ctrl register
 *  sharp pix2matrix ctrl
 */
typedef union {
    struct {
        /** sharp_tail_pixen_pulse_tl : R/W; bitpos: [7:0]; default: 0;
         *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
         *  next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and
         *  reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th <
         *  reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function
         */
        uint32_t sharp_tail_pixen_pulse_tl:8;
        /** sharp_tail_pixen_pulse_th : R/W; bitpos: [15:8]; default: 0;
         *  matrix tail pixen high level threshold, must < hnum-1, only
         *  reg_sharp_tail_pixen_pulse_th!=0 and reg_sharp_tail_pixen_pulse_tl!=0 and
         *  reg_sharp_tail_pixen_pulse_th < reg_sharp_tail_pixen_pulse_tl will enable tail
         *  pulse function
         */
        uint32_t sharp_tail_pixen_pulse_th:8;
        /** sharp_padding_data : R/W; bitpos: [23:16]; default: 0;
         *  this field configures sharp padding data
         */
        uint32_t sharp_padding_data:8;
        /** sharp_padding_mode : R/W; bitpos: [24]; default: 0;
         *  this field configures sharp padding mode
         */
        uint32_t sharp_padding_mode:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} isp_sharp_matrix_ctrl_reg_t;

/** Type of sharp_ctrl1 register
 *  sharp control register 1
 */
typedef union {
    struct {
        /** sharp_gradient_max : RO; bitpos: [7:0]; default: 0;
         *  this field configures sharp max gradient, refresh at the end of each frame end
         */
        uint32_t sharp_gradient_max:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} isp_sharp_ctrl1_reg_t;

/** Type of dma_cntl register
 *  isp dma source trans control register
 */
typedef union {
    struct {
        /** dma_en : WT; bitpos: [0]; default: 0;
         *  write 1 to trigger dma to get 1 frame
         */
        uint32_t dma_en:1;
        /** dma_update_reg : R/W; bitpos: [1]; default: 0;
         *  write 1 to update reg_dma_burst_len & reg_dma_data_type
         */
        uint32_t dma_update_reg:1;
        /** dma_data_type : R/W; bitpos: [7:2]; default: 42;
         *  this field configures the idi data type for image data
         */
        uint32_t dma_data_type:6;
        /** dma_burst_len : R/W; bitpos: [19:8]; default: 128;
         *  this field configures dma burst len when data source is dma. set according to
         *  dma_msize, it is the number of 64bits in a dma transfer
         */
        uint32_t dma_burst_len:12;
        /** dma_interval : R/W; bitpos: [31:20]; default: 1;
         *  this field configures dma req interval, 12'b1: 1 cycle, 12'b11 2 cycle ...
         */
        uint32_t dma_interval:12;
    };
    uint32_t val;
} isp_dma_cntl_reg_t;

/** Type of dma_raw_data register
 *  isp dma source total raw number set register
 */
typedef union {
    struct {
        /** dma_raw_num_total : R/W; bitpos: [21:0]; default: 0;
         *  this field configures the the number of 64bits in a frame
         */
        uint32_t dma_raw_num_total:22;
        uint32_t reserved_22:9;
        /** dma_raw_num_total_set : WT; bitpos: [31]; default: 0;
         *  write 1 to update reg_dma_raw_num_total
         */
        uint32_t dma_raw_num_total_set:1;
    };
    uint32_t val;
} isp_dma_raw_data_reg_t;

/** Type of cam_cntl register
 *  isp cam source control register
 */
typedef union {
    struct {
        /** cam_en : R/W; bitpos: [0]; default: 0;
         *  write 1 to start receive camera data, write 0 to disable
         */
        uint32_t cam_en:1;
        /** cam_update_reg : R/W; bitpos: [1]; default: 0;
         *  write 1 to update ISP_CAM_CONF
         */
        uint32_t cam_update_reg:1;
        /** cam_reset : R/W; bitpos: [2]; default: 1;
         *  this bit configures cam clk domain reset, 1: reset cam input logic, 0: release reset
         */
        uint32_t cam_reset:1;
        /** cam_clk_inv : R/W; bitpos: [3]; default: 0;
         *  this bit configures the inversion of cam clk from pad. 0: not invert cam clk, 1:
         *  invert cam clk
         */
        uint32_t cam_clk_inv:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} isp_cam_cntl_reg_t;

/** Type of cam_conf register
 *  isp cam source config register
 */
typedef union {
    struct {
        /** cam_data_order : R/W; bitpos: [0]; default: 0;
         *  this field configures data order of cam port, 0: cam_data_in, 1:{cam_data_in[7:0],
         *  cam_data_in[15:8]}
         */
        uint32_t cam_data_order:1;
        /** cam_2byte_mode : R/W; bitpos: [1]; default: 0;
         *  this field configures enable of cam 2 byte mode(input 2 bytes each clock). 0:
         *  disable, 1: enable
         */
        uint32_t cam_2byte_mode:1;
        /** cam_data_type : R/W; bitpos: [7:2]; default: 42;
         *  this field configures idi data type for image data, 0x2a: RAW8, 0x2b: RAW10, 0x2c:
         *  RAW12
         */
        uint32_t cam_data_type:6;
        /** cam_de_inv : R/W; bitpos: [8]; default: 0;
         *  this bit configures cam data enable invert. 0: not invert, 1: invert
         */
        uint32_t cam_de_inv:1;
        /** cam_hsync_inv : R/W; bitpos: [9]; default: 0;
         *  this bit configures cam hsync invert. 0: not invert, 1: invert
         */
        uint32_t cam_hsync_inv:1;
        /** cam_vsync_inv : R/W; bitpos: [10]; default: 0;
         *  this bit configures cam vsync invert. 0: not invert, 1: invert
         */
        uint32_t cam_vsync_inv:1;
        /** cam_vsync_filter_thres : R/W; bitpos: [13:11]; default: 0;
         *  this bit configures the number of clock of vsync filter length
         */
        uint32_t cam_vsync_filter_thres:3;
        /** cam_vsync_filter_en : R/W; bitpos: [14]; default: 0;
         *  this bit configures vsync filter en
         */
        uint32_t cam_vsync_filter_en:1;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} isp_cam_conf_reg_t;

