espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of af_ctrl0 register
 *  af control register 0
 */
typedef union {
    struct {
        /** af_auto_update : R/W; bitpos: [0]; default: 0;
         *  this bit configures auto_update enable. when set to 1, will update sum and lum each
         *  frame
         */
        uint32_t af_auto_update:1;
        uint32_t reserved_1:3;
        /** af_manual_update : WT; bitpos: [4]; default: 0;
         *  write 1 to this bit will update the sum and lum once
         */
        uint32_t af_manual_update:1;
        uint32_t reserved_5:3;
        /** af_env_threshold : R/W; bitpos: [11:8]; default: 0;
         *  this field configures env threshold. when both sum and lum changes larger than this
         *  value, consider environment changes and need to trigger a new autofocus. 4Bit
         *  fractional
         */
        uint32_t af_env_threshold:4;
        uint32_t reserved_12:4;
        /** af_env_period : R/W; bitpos: [23:16]; default: 0;
         *  this field configures environment changes detection period (frame). When set to 0,
         *  disable this function
         */
        uint32_t af_env_period:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_af_ctrl0_reg_t;

/** Type of af_ctrl1 register
 *  af control register 1
 */
typedef union {
    struct {
        /** af_thpixnum : R/W; bitpos: [21:0]; default: 0;
         *  this field configures pixnum used when calculating the autofocus threshold. Set to
         *  0 to disable threshold calculation
         */
        uint32_t af_thpixnum:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} isp_af_ctrl1_reg_t;

/** Type of af_gen_th_ctrl register
 *  af gen threshold control register
 */
typedef union {
    struct {
        /** af_gen_threshold_min : R/W; bitpos: [15:0]; default: 128;
         *  this field configures min threshold when use auto_threshold
         */
        uint32_t af_gen_threshold_min:16;
        /** af_gen_threshold_max : R/W; bitpos: [31:16]; default: 1088;
         *  this field configures max threshold when use auto_threshold
         */
        uint32_t af_gen_threshold_max:16;
    };
    uint32_t val;
} isp_af_gen_th_ctrl_reg_t;

/** Type of af_env_user_th_sum register
 *  af monitor user sum threshold register
 */
typedef union {
    struct {
        /** af_env_user_threshold_sum : R/W; bitpos: [31:0]; default: 0;
         *  this field configures user setup env detect sum threshold
         */
        uint32_t af_env_user_threshold_sum:32;
    };
    uint32_t val;
} isp_af_env_user_th_sum_reg_t;

/** Type of af_env_user_th_lum register
 *  af monitor user lum threshold register
 */
typedef union {
    struct {
        /** af_env_user_threshold_lum : R/W; bitpos: [29:0]; default: 0;
         *  this field configures user setup env detect lum threshold
         */
        uint32_t af_env_user_threshold_lum:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_env_user_th_lum_reg_t;

/** Type of af_threshold register
 *  af threshold register
 */
typedef union {
    struct {
        /** af_threshold : R/W; bitpos: [15:0]; default: 256;
         *  this field configures user threshold. When set to non-zero, autofocus will use this
         *  threshold
         */
        uint32_t af_threshold:16;
        /** af_gen_threshold : RO; bitpos: [31:16]; default: 0;
         *  this field represents the last calculated threshold
         */
        uint32_t af_gen_threshold:16;
    };
    uint32_t val;
} isp_af_threshold_reg_t;

/** Type of af_hscale_a register
 *  h-scale of af window a register
 */
typedef union {
    struct {
        /** af_rpoint_a : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window a, must >= 2
         */
        uint32_t af_rpoint_a:12;
        uint32_t reserved_12:4;
        /** af_lpoint_a : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window a, must >= 2
         */
        uint32_t af_lpoint_a:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_a_reg_t;

/** Type of af_vscale_a register
 *  v-scale of af window a register
 */
typedef union {
    struct {
        /** af_bpoint_a : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window a, must <= hnum-2
         */
        uint32_t af_bpoint_a:12;
        uint32_t reserved_12:4;
        /** af_tpoint_a : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window a, must <= hnum-2
         */
        uint32_t af_tpoint_a:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_a_reg_t;

/** Type of af_hscale_b register
 *  h-scale of af window b register
 */
typedef union {
    struct {
        /** af_rpoint_b : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window b, must >= 2
         */
        uint32_t af_rpoint_b:12;
        uint32_t reserved_12:4;
        /** af_lpoint_b : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window b, must >= 2
         */
        uint32_t af_lpoint_b:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_b_reg_t;

/** Type of af_vscale_b register
 *  v-scale of af window b register
 */
typedef union {
    struct {
        /** af_bpoint_b : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window b, must <= hnum-2
         */
        uint32_t af_bpoint_b:12;
        uint32_t reserved_12:4;
        /** af_tpoint_b : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window b, must <= hnum-2
         */
        uint32_t af_tpoint_b:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_b_reg_t;

/** Type of af_hscale_c register
 *  v-scale of af window c register
 */
typedef union {
    struct {
        /** af_rpoint_c : R/W; bitpos: [11:0]; default: 128;
         *  this field configures left coordinate of focus window c, must >= 2
         */
        uint32_t af_rpoint_c:12;
        uint32_t reserved_12:4;
        /** af_lpoint_c : R/W; bitpos: [27:16]; default: 1;
         *  this field configures top coordinate of focus window c, must >= 2
         */
        uint32_t af_lpoint_c:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_hscale_c_reg_t;

/** Type of af_vscale_c register
 *  v-scale of af window c register
 */
typedef union {
    struct {
        /** af_bpoint_c : R/W; bitpos: [11:0]; default: 128;
         *  this field configures right coordinate of focus window c, must <= hnum-2
         */
        uint32_t af_bpoint_c:12;
        uint32_t reserved_12:4;
        /** af_tpoint_c : R/W; bitpos: [27:16]; default: 1;
         *  this field configures bottom coordinate of focus window c, must <= hnum-2
         */
        uint32_t af_tpoint_c:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_vscale_c_reg_t;

/** Type of awb_mode register
 *  awb mode control register
 */
typedef union {
    struct {
        /** awb_mode : R/W; bitpos: [1:0]; default: 3;
         *  this field configures awb algo sel. 00: none selected. 01: sel algo0. 10: sel
         *  algo1. 11: sel both algo0 and algo1
         */
        uint32_t awb_mode:2;
        uint32_t reserved_2:2;
        /** awb_sample : R/W; bitpos: [4]; default: 0;
         *  this bit configures awb sample location, 0:before ccm, 1:after ccm
         */
        uint32_t awb_sample:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} isp_awb_mode_reg_t;

/** Type of awb_hscale register
 *  h-scale of awb window
 */
typedef union {
    struct {
        /** awb_rpoint : R/W; bitpos: [11:0]; default: 1919;
         *  this field configures awb window right coordinate
         */
        uint32_t awb_rpoint:12;
        uint32_t reserved_12:4;
        /** awb_lpoint : R/W; bitpos: [27:16]; default: 0;
         *  this field configures awb window left coordinate
         */
        uint32_t awb_lpoint:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_awb_hscale_reg_t;

/** Type of awb_vscale register
 *  v-scale of awb window
 */
typedef union {
    struct {
        /** awb_bpoint : R/W; bitpos: [11:0]; default: 1079;
         *  this field configures awb window bottom coordinate
         */
        uint32_t awb_bpoint:12;
        uint32_t reserved_12:4;
        /** awb_tpoint : R/W; bitpos: [27:16]; default: 0;
         *  this field configures awb window top coordinate
         */
        uint32_t awb_tpoint:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_awb_vscale_reg_t;

/** Type of awb_th_lum register
 *  awb lum threshold register
 */
typedef union {
    struct {
        /** awb_min_lum : R/W; bitpos: [9:0]; default: 0;
         *  this field configures lower threshold of r+g+b
         */
        uint32_t awb_min_lum:10;
        uint32_t reserved_10:6;
        /** awb_max_lum : R/W; bitpos: [25:16]; default: 765;
         *  this field configures upper threshold of r+g+b
         */
        uint32_t awb_max_lum:10;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} isp_awb_th_lum_reg_t;

