espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of mem_aux_ctrl_0 register
 *  mem aux control register 0
 */
typedef union {
    struct {
        /** header_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of isp input buffer memory
         */
        uint32_t header_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** dpc_lut_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field represents this field configures the mem_aux of dpc lut memory
         */
        uint32_t dpc_lut_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_0_reg_t;

/** Type of mem_aux_ctrl_1 register
 *  mem aux control register 1
 */
typedef union {
    struct {
        /** lsc_lut_r_gr_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of lsc r gr lut memory
         */
        uint32_t lsc_lut_r_gr_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** lsc_lut_gb_b_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of lsc gb b lut memory
         */
        uint32_t lsc_lut_gb_b_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_1_reg_t;

/** Type of mem_aux_ctrl_2 register
 *  mem aux control register 2
 */
typedef union {
    struct {
        /** bf_matrix_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of bf line buffer memory
         */
        uint32_t bf_matrix_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** dpc_matrix_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of dpc line buffer memory
         */
        uint32_t dpc_matrix_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_2_reg_t;

/** Type of mem_aux_ctrl_3 register
 *  mem aux control register 3
 */
typedef union {
    struct {
        /** sharp_matrix_y_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of sharp y line buffer memory
         */
        uint32_t sharp_matrix_y_mem_aux_ctrl:14;
        uint32_t reserved_14:2;
        /** demosaic_matrix_mem_aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  this field configures the mem_aux of demosaic line buffer memory
         */
        uint32_t demosaic_matrix_mem_aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_mem_aux_ctrl_3_reg_t;

/** Type of mem_aux_ctrl_4 register
 *  mem aux control register 4
 */
typedef union {
    struct {
        /** sharp_matrix_uv_mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  this field configures the mem_aux of sharp uv line buffer memory
         */
        uint32_t sharp_matrix_uv_mem_aux_ctrl:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} isp_mem_aux_ctrl_4_reg_t;

/** Type of yuv_format register
 *  yuv format control register
 */
typedef union {
    struct {
        /** yuv_mode : R/W; bitpos: [0]; default: 0;
         *  this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709
         */
        uint32_t yuv_mode:1;
        /** yuv_range : R/W; bitpos: [1]; default: 0;
         *  this bit configures the yuv range. 0: full range, 1: limit range
         */
        uint32_t yuv_range:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_yuv_format_reg_t;

/** Type of rdn_eco_low register
 *  rdn eco all low register
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  rdn_eco_low
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} isp_rdn_eco_low_reg_t;

/** Type of rdn_eco_high register
 *  rdn eco all high register
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  rdn_eco_high
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} isp_rdn_eco_high_reg_t;


/** Group: Status Registers */
/** Type of dpc_deadpix_cnt register
 *  DPC dead-pix number register
 */
typedef union {
    struct {
        /** dpc_deadpix_cnt : RO; bitpos: [9:0]; default: 0;
         *  this field represents the dead pixel count
         */
        uint32_t dpc_deadpix_cnt:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} isp_dpc_deadpix_cnt_reg_t;

/** Type of lut_rdata register
 *  LUT read data register
 */
typedef union {
    struct {
        /** lut_rdata : RO; bitpos: [31:0]; default: 0;
         *  this field represents the read data of lut. read ISP_LUT_RDATA after write
         *  ISP_LUT_CMD register
         */
        uint32_t lut_rdata:32;
    };
    uint32_t val;
} isp_lut_rdata_reg_t;

/** Type of ae_block_mean register
 *  ae statistic result
 */
typedef union {
    struct {
        /** ae_lum : RO; bitpos: [31:0]; default: 0;
         *  this field represents the result of AE block
         */
        uint8_t ae_b_mean[4];
    };
    uint32_t val;
} isp_ae_block_mean_reg_t;

/** Type of ae_block_mean_0 register
 *  ae statistic result register 0
 */
typedef union {
    struct {
        /** ae_b03_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block03 Y mean data
         */
        uint32_t ae_b03_mean:8;
        /** ae_b02_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block02 Y mean data
         */
        uint32_t ae_b02_mean:8;
        /** ae_b01_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block01 Y mean data
         */
        uint32_t ae_b01_mean:8;
        /** ae_b00_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block00 Y mean data
         */
        uint32_t ae_b00_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_0_reg_t;

/** Type of ae_block_mean_1 register
 *  ae statistic result register 1
 */
typedef union {
    struct {
        /** ae_b12_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block12 Y mean data
         */
        uint32_t ae_b12_mean:8;
        /** ae_b11_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block11 Y mean data
         */
        uint32_t ae_b11_mean:8;
        /** ae_b10_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block10 Y mean data
         */
        uint32_t ae_b10_mean:8;
        /** ae_b04_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block04 Y mean data
         */
        uint32_t ae_b04_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_1_reg_t;

/** Type of ae_block_mean_2 register
 *  ae statistic result register 2
 */
typedef union {
    struct {
        /** ae_b21_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block21 Y mean data
         */
        uint32_t ae_b21_mean:8;
        /** ae_b20_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block20 Y mean data
         */
        uint32_t ae_b20_mean:8;
        /** ae_b14_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block14 Y mean data
         */
        uint32_t ae_b14_mean:8;
        /** ae_b13_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block13 Y mean data
         */
        uint32_t ae_b13_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_2_reg_t;

