espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of ae_block_mean_3 register
 *  ae statistic result register 3
 */
typedef union {
    struct {
        /** ae_b30_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block30 Y mean data
         */
        uint32_t ae_b30_mean:8;
        /** ae_b24_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block24 Y mean data
         */
        uint32_t ae_b24_mean:8;
        /** ae_b23_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block23 Y mean data
         */
        uint32_t ae_b23_mean:8;
        /** ae_b22_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block22 Y mean data
         */
        uint32_t ae_b22_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_3_reg_t;

/** Type of ae_block_mean_4 register
 *  ae statistic result register 4
 */
typedef union {
    struct {
        /** ae_b34_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block34 Y mean data
         */
        uint32_t ae_b34_mean:8;
        /** ae_b33_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block33 Y mean data
         */
        uint32_t ae_b33_mean:8;
        /** ae_b32_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block32 Y mean data
         */
        uint32_t ae_b32_mean:8;
        /** ae_b31_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block31 Y mean data
         */
        uint32_t ae_b31_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_4_reg_t;

/** Type of ae_block_mean_5 register
 *  ae statistic result register 5
 */
typedef union {
    struct {
        /** ae_b43_mean : RO; bitpos: [7:0]; default: 0;
         *  this field configures block43 Y mean data
         */
        uint32_t ae_b43_mean:8;
        /** ae_b42_mean : RO; bitpos: [15:8]; default: 0;
         *  this field configures block42 Y mean data
         */
        uint32_t ae_b42_mean:8;
        /** ae_b41_mean : RO; bitpos: [23:16]; default: 0;
         *  this field configures block41 Y mean data
         */
        uint32_t ae_b41_mean:8;
        /** ae_b40_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block40 Y mean data
         */
        uint32_t ae_b40_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_5_reg_t;

/** Type of ae_block_mean_6 register
 *  ae statistic result register 6
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** ae_b44_mean : RO; bitpos: [31:24]; default: 0;
         *  this field configures block44 Y mean data
         */
        uint32_t ae_b44_mean:8;
    };
    uint32_t val;
} isp_ae_block_mean_6_reg_t;
/** Type of af_sum_a register
 *  result of sum of af window a
 */
typedef union {
    struct {
        /** af_suma : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window a
         */
        uint32_t af_suma:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_a_reg_t;

/** Type of af_sum_b register
 *  result of sum of af window b
 */
typedef union {
    struct {
        /** af_sumb : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window b
         */
        uint32_t af_sumb:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_b_reg_t;

/** Type of af_sum_c register
 *  result of sum of af window c
 */
typedef union {
    struct {
        /** af_sumc : RO; bitpos: [29:0]; default: 0;
         *  this field represents the result of accumulation of pix grad of focus window c
         */
        uint32_t af_sumc:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} isp_af_sum_c_reg_t;

/** Type of af_lum_a register
 *  result of lum of af window a
 */
typedef union {
    struct {
        /** af_luma : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window a
         */
        uint32_t af_luma:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_a_reg_t;

/** Type of af_lum_b register
 *  result of lum of af window b
 */
typedef union {
    struct {
        /** af_lumb : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window b
         */
        uint32_t af_lumb:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_b_reg_t;

/** Type of af_lum_c register
 *  result of lum of af window c
 */
typedef union {
    struct {
        /** af_lumc : RO; bitpos: [27:0]; default: 0;
         *  this field represents the result of accumulation of pix light of focus window c
         */
        uint32_t af_lumc:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} isp_af_lum_c_reg_t;

/** Type of awb0_white_cnt register
 *  result of awb white point number
 */
typedef union {
    struct {
        /** awb0_white_cnt : RO; bitpos: [23:0]; default: 0;
         *  this field configures number of white point detected of algo0
         */
        uint32_t awb0_white_cnt:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} isp_awb0_white_cnt_reg_t;

/** Type of awb0_acc_r register
 *  result of accumulate of r channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_r : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel r of all white point of algo0
         */
        uint32_t awb0_acc_r:32;
    };
    uint32_t val;
} isp_awb0_acc_r_reg_t;

/** Type of awb0_acc_g register
 *  result of accumulate of g channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_g : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel g of all white point of algo0
         */
        uint32_t awb0_acc_g:32;
    };
    uint32_t val;
} isp_awb0_acc_g_reg_t;

/** Type of awb0_acc_b register
 *  result of accumulate of b channel of all white points
 */
typedef union {
    struct {
        /** awb0_acc_b : RO; bitpos: [31:0]; default: 0;
         *  this field represents accumulate of channel b of all white point of algo0
         */
        uint32_t awb0_acc_b:32;
    };
    uint32_t val;
} isp_awb0_acc_b_reg_t;

/** Type of blc_mean register
 *  results of the average of black window
 */
typedef union {
    struct {
        /** blc_r3_mean : RO; bitpos: [7:0]; default: 0;
         *  this field represents the average black value of bottom right channel
         */
        uint32_t blc_r3_mean:8;
        /** blc_r2_mean : RO; bitpos: [15:8]; default: 0;
         *  this field represents the average black value of bottom left channel
         */
        uint32_t blc_r2_mean:8;
        /** blc_r1_mean : RO; bitpos: [23:16]; default: 0;
         *  this field represents the average black value of top right channel
         */
        uint32_t blc_r1_mean:8;
        /** blc_r0_mean : RO; bitpos: [31:24]; default: 0;
         *  this field represents the average black value of top left channel
         */
        uint32_t blc_r0_mean:8;
    };
    uint32_t val;
} isp_blc_mean_reg_t;

/** Type of hist_bin register
 *  result of histogram bin n
 */
typedef union {
    struct {
        /** hist_bin_n : RO; bitpos: [16:0]; default: 0;
         *  this field represents result of histogram bin n
         */
        uint32_t hist_bin_n:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} isp_hist_binn_reg_t;

/** Type of rdn_eco_cs register
 *  rdn eco cs register
 */
typedef union {
    struct {
        /** rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  rdn_eco_en
         */
        uint32_t rdn_eco_en:1;
        /** rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  rdn_eco_result
         */
        uint32_t rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} isp_rdn_eco_cs_reg_t;


/** Group: Interrupt Registers */
/** Type of int_raw register
 *  raw interrupt register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_raw : R/SS/WTC; bitpos: [0]; default: 0;
         *  the raw interrupt status of input data type error. isp only support RGB bayer data
         *  type, other type will report type_err_int
         */
        uint32_t isp_data_type_err_int_raw:1;
        /** isp_async_fifo_ovf_int_raw : R/SS/WTC; bitpos: [1]; default: 0;
         *  the raw interrupt status of isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_raw:1;
        /** isp_buf_full_int_raw : R/SS/WTC; bitpos: [2]; default: 0;
         *  the raw interrupt status of isp input buffer full
         */
        uint32_t isp_buf_full_int_raw:1;
        /** isp_hvnum_setting_err_int_raw : R/SS/WTC; bitpos: [3]; default: 0;
         *  the raw interrupt status of hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_raw:1;
        /** isp_data_type_setting_err_int_raw : R/SS/WTC; bitpos: [4]; default: 0;
         *  the raw interrupt status of setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_raw:1;
        /** isp_mipi_hnum_unmatch_int_raw : R/SS/WTC; bitpos: [5]; default: 0;
         *  the raw interrupt status of hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_raw:1;
        /** dpc_check_done_int_raw : R/SS/WTC; bitpos: [6]; default: 0;
         *  the raw interrupt status of dpc check done
         */
        uint32_t dpc_check_done_int_raw:1;
        /** gamma_xcoord_err_int_raw : R/SS/WTC; bitpos: [7]; default: 0;
         *  the raw interrupt status of gamma setting error. it report the sum of the lengths
         *  represented by reg_gamma_x00~x0F isn't equal to 256
         */
        uint32_t gamma_xcoord_err_int_raw:1;
        /** ae_monitor_int_raw : R/SS/WTC; bitpos: [8]; default: 0;
         *  the raw interrupt status of ae monitor
         */
        uint32_t ae_monitor_int_raw:1;
        /** ae_frame_done_int_raw : R/SS/WTC; bitpos: [9]; default: 0;
         *  the raw interrupt status of ae.
         */
        uint32_t ae_frame_done_int_raw:1;
        /** af_fdone_int_raw : R/SS/WTC; bitpos: [10]; default: 0;
         *  the raw interrupt status of af statistic. when auto_update enable, each frame done
         *  will send one int pulse when manual_update, each time when write 1 to
         *  reg_manual_update will send a int pulse when next frame done
         */
        uint32_t af_fdone_int_raw:1;
        /** af_env_int_raw : R/SS/WTC; bitpos: [11]; default: 0;
         *  the raw interrupt status of af monitor. send a int pulse when env_det function
         *  enabled and environment changes detected
         */
        uint32_t af_env_int_raw:1;
        /** awb_fdone_int_raw : R/SS/WTC; bitpos: [12]; default: 0;
         *  the raw interrupt status of awb. send a int pulse when statistic of one awb frame
         *  done
         */
        uint32_t awb_fdone_int_raw:1;
        /** hist_fdone_int_raw : R/SS/WTC; bitpos: [13]; default: 0;
         *  the raw interrupt status of histogram. send a int pulse when statistic of one frame
         *  histogram done
         */
        uint32_t hist_fdone_int_raw:1;
        /** frame_int_raw : R/SS/WTC; bitpos: [14]; default: 0;
         *  the raw interrupt status of isp frame end
         */
        uint32_t frame_int_raw:1;
        /** blc_frame_int_raw : R/SS/WTC; bitpos: [15]; default: 0;
         *  the raw interrupt status of blc frame done
         */
        uint32_t blc_frame_int_raw:1;
        /** lsc_frame_int_raw : R/SS/WTC; bitpos: [16]; default: 0;
         *  the raw interrupt status of lsc frame done
         */
        uint32_t lsc_frame_int_raw:1;
        /** dpc_frame_int_raw : R/SS/WTC; bitpos: [17]; default: 0;
         *  the raw interrupt status of dpc frame done
         */
        uint32_t dpc_frame_int_raw:1;
        /** bf_frame_int_raw : R/SS/WTC; bitpos: [18]; default: 0;
         *  the raw interrupt status of bf frame done
         */
        uint32_t bf_frame_int_raw:1;
        /** demosaic_frame_int_raw : R/SS/WTC; bitpos: [19]; default: 0;
         *  the raw interrupt status of demosaic frame done
         */
        uint32_t demosaic_frame_int_raw:1;
        /** median_frame_int_raw : R/SS/WTC; bitpos: [20]; default: 0;
         *  the raw interrupt status of median frame done
         */
        uint32_t median_frame_int_raw:1;
        /** ccm_frame_int_raw : R/SS/WTC; bitpos: [21]; default: 0;
         *  the raw interrupt status of ccm frame done
         */
        uint32_t ccm_frame_int_raw:1;
        /** gamma_frame_int_raw : R/SS/WTC; bitpos: [22]; default: 0;
         *  the raw interrupt status of gamma frame done
         */
        uint32_t gamma_frame_int_raw:1;
        /** rgb2yuv_frame_int_raw : R/SS/WTC; bitpos: [23]; default: 0;
         *  the raw interrupt status of rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_raw:1;
        /** sharp_frame_int_raw : R/SS/WTC; bitpos: [24]; default: 0;
         *  the raw interrupt status of sharp frame done
         */
        uint32_t sharp_frame_int_raw:1;
        /** color_frame_int_raw : R/SS/WTC; bitpos: [25]; default: 0;
         *  the raw interrupt status of color frame done
         */
        uint32_t color_frame_int_raw:1;
        /** yuv2rgb_frame_int_raw : R/SS/WTC; bitpos: [26]; default: 0;
         *  the raw interrupt status of yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_raw:1;
        /** tail_idi_frame_int_raw : R/SS/WTC; bitpos: [27]; default: 0;
         *  the raw interrupt status of isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_raw:1;
        /** header_idi_frame_int_raw : R/SS/WTC; bitpos: [28]; default: 0;
         *  the raw interrupt status of real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_raw:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} isp_int_raw_reg_t;

/** Type of int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of input data type error
         */
        uint32_t isp_data_type_err_int_st:1;
        /** isp_async_fifo_ovf_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_st:1;
        /** isp_buf_full_int_st : RO; bitpos: [2]; default: 0;
         *  the masked interrupt status of isp input buffer full
         */
        uint32_t isp_buf_full_int_st:1;
        /** isp_hvnum_setting_err_int_st : RO; bitpos: [3]; default: 0;
         *  the masked interrupt status of hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_st:1;
        /** isp_data_type_setting_err_int_st : RO; bitpos: [4]; default: 0;
         *  the masked interrupt status of setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_st:1;
        /** isp_mipi_hnum_unmatch_int_st : RO; bitpos: [5]; default: 0;
         *  the masked interrupt status of hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_st:1;
        /** dpc_check_done_int_st : RO; bitpos: [6]; default: 0;
         *  the masked interrupt status of dpc check done
         */
        uint32_t dpc_check_done_int_st:1;
        /** gamma_xcoord_err_int_st : RO; bitpos: [7]; default: 0;
         *  the masked interrupt status of gamma setting error
         */
        uint32_t gamma_xcoord_err_int_st:1;
        /** ae_monitor_int_st : RO; bitpos: [8]; default: 0;
         *  the masked interrupt status of ae monitor
         */
        uint32_t ae_monitor_int_st:1;
        /** ae_frame_done_int_st : RO; bitpos: [9]; default: 0;
         *  the masked interrupt status of ae
         */
        uint32_t ae_frame_done_int_st:1;
        /** af_fdone_int_st : RO; bitpos: [10]; default: 0;
         *  the masked interrupt status of af statistic
         */
        uint32_t af_fdone_int_st:1;
        /** af_env_int_st : RO; bitpos: [11]; default: 0;
         *  the masked interrupt status of af monitor
         */
        uint32_t af_env_int_st:1;
        /** awb_fdone_int_st : RO; bitpos: [12]; default: 0;
         *  the masked interrupt status of awb
         */
        uint32_t awb_fdone_int_st:1;
        /** hist_fdone_int_st : RO; bitpos: [13]; default: 0;
         *  the masked interrupt status of histogram
         */
        uint32_t hist_fdone_int_st:1;
        /** frame_int_st : RO; bitpos: [14]; default: 0;
         *  the masked interrupt status of isp frame end
         */
        uint32_t frame_int_st:1;
        /** blc_frame_int_st : RO; bitpos: [15]; default: 0;
         *  the masked interrupt status of blc frame done
         */
        uint32_t blc_frame_int_st:1;
        /** lsc_frame_int_st : RO; bitpos: [16]; default: 0;
         *  the masked interrupt status of lsc frame done
         */
        uint32_t lsc_frame_int_st:1;
        /** dpc_frame_int_st : RO; bitpos: [17]; default: 0;
         *  the masked interrupt status of dpc frame done
         */
        uint32_t dpc_frame_int_st:1;
        /** bf_frame_int_st : RO; bitpos: [18]; default: 0;
         *  the masked interrupt status of bf frame done
         */
        uint32_t bf_frame_int_st:1;
        /** demosaic_frame_int_st : RO; bitpos: [19]; default: 0;
         *  the masked interrupt status of demosaic frame done
         */
        uint32_t demosaic_frame_int_st:1;
        /** median_frame_int_st : RO; bitpos: [20]; default: 0;
         *  the masked interrupt status of median frame done
         */
        uint32_t median_frame_int_st:1;
        /** ccm_frame_int_st : RO; bitpos: [21]; default: 0;
         *  the masked interrupt status of ccm frame done
         */
        uint32_t ccm_frame_int_st:1;
        /** gamma_frame_int_st : RO; bitpos: [22]; default: 0;
         *  the masked interrupt status of gamma frame done
         */
        uint32_t gamma_frame_int_st:1;
        /** rgb2yuv_frame_int_st : RO; bitpos: [23]; default: 0;
         *  the masked interrupt status of rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_st:1;
        /** sharp_frame_int_st : RO; bitpos: [24]; default: 0;
         *  the masked interrupt status of sharp frame done
         */
        uint32_t sharp_frame_int_st:1;
        /** color_frame_int_st : RO; bitpos: [25]; default: 0;
         *  the masked interrupt status of color frame done
         */
        uint32_t color_frame_int_st:1;
        /** yuv2rgb_frame_int_st : RO; bitpos: [26]; default: 0;
         *  the masked interrupt status of yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_st:1;
        /** tail_idi_frame_int_st : RO; bitpos: [27]; default: 0;
         *  the masked interrupt status of isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_st:1;
        /** header_idi_frame_int_st : RO; bitpos: [28]; default: 0;
         *  the masked interrupt status of real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_st:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} isp_int_st_reg_t;

