espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
/** Type of int_ena register
 *  interrupt enable register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_ena : R/W; bitpos: [0]; default: 1;
         *  write 1 to enable input data type error
         */
        uint32_t isp_data_type_err_int_ena:1;
        /** isp_async_fifo_ovf_int_ena : R/W; bitpos: [1]; default: 1;
         *  write 1 to enable isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_ena:1;
        /** isp_buf_full_int_ena : R/W; bitpos: [2]; default: 0;
         *  write 1 to enable isp input buffer full
         */
        uint32_t isp_buf_full_int_ena:1;
        /** isp_hvnum_setting_err_int_ena : R/W; bitpos: [3]; default: 0;
         *  write 1 to enable hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_ena:1;
        /** isp_data_type_setting_err_int_ena : R/W; bitpos: [4]; default: 0;
         *  write 1 to enable setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_ena:1;
        /** isp_mipi_hnum_unmatch_int_ena : R/W; bitpos: [5]; default: 0;
         *  write 1 to enable hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_ena:1;
        /** dpc_check_done_int_ena : R/W; bitpos: [6]; default: 1;
         *  write 1 to enable dpc check done
         */
        uint32_t dpc_check_done_int_ena:1;
        /** gamma_xcoord_err_int_ena : R/W; bitpos: [7]; default: 1;
         *  write 1 to enable gamma setting error
         */
        uint32_t gamma_xcoord_err_int_ena:1;
        /** ae_monitor_int_ena : R/W; bitpos: [8]; default: 0;
         *  write 1 to enable ae monitor
         */
        uint32_t ae_monitor_int_ena:1;
        /** ae_frame_done_int_ena : R/W; bitpos: [9]; default: 0;
         *  write 1 to enable ae
         */
        uint32_t ae_frame_done_int_ena:1;
        /** af_fdone_int_ena : R/W; bitpos: [10]; default: 0;
         *  write 1 to enable af statistic
         */
        uint32_t af_fdone_int_ena:1;
        /** af_env_int_ena : R/W; bitpos: [11]; default: 0;
         *  write 1 to enable af monitor
         */
        uint32_t af_env_int_ena:1;
        /** awb_fdone_int_ena : R/W; bitpos: [12]; default: 0;
         *  write 1 to enable awb
         */
        uint32_t awb_fdone_int_ena:1;
        /** hist_fdone_int_ena : R/W; bitpos: [13]; default: 0;
         *  write 1 to enable histogram
         */
        uint32_t hist_fdone_int_ena:1;
        /** frame_int_ena : R/W; bitpos: [14]; default: 0;
         *  write 1 to enable isp frame end
         */
        uint32_t frame_int_ena:1;
        /** blc_frame_int_ena : R/W; bitpos: [15]; default: 0;
         *  write 1 to enable blc frame done
         */
        uint32_t blc_frame_int_ena:1;
        /** lsc_frame_int_ena : R/W; bitpos: [16]; default: 0;
         *  write 1 to enable lsc frame done
         */
        uint32_t lsc_frame_int_ena:1;
        /** dpc_frame_int_ena : R/W; bitpos: [17]; default: 0;
         *  write 1 to enable dpc frame done
         */
        uint32_t dpc_frame_int_ena:1;
        /** bf_frame_int_ena : R/W; bitpos: [18]; default: 0;
         *  write 1 to enable bf frame done
         */
        uint32_t bf_frame_int_ena:1;
        /** demosaic_frame_int_ena : R/W; bitpos: [19]; default: 0;
         *  write 1 to enable demosaic frame done
         */
        uint32_t demosaic_frame_int_ena:1;
        /** median_frame_int_ena : R/W; bitpos: [20]; default: 0;
         *  write 1 to enable median frame done
         */
        uint32_t median_frame_int_ena:1;
        /** ccm_frame_int_ena : R/W; bitpos: [21]; default: 0;
         *  write 1 to enable ccm frame done
         */
        uint32_t ccm_frame_int_ena:1;
        /** gamma_frame_int_ena : R/W; bitpos: [22]; default: 0;
         *  write 1 to enable gamma frame done
         */
        uint32_t gamma_frame_int_ena:1;
        /** rgb2yuv_frame_int_ena : R/W; bitpos: [23]; default: 0;
         *  write 1 to enable rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_ena:1;
        /** sharp_frame_int_ena : R/W; bitpos: [24]; default: 0;
         *  write 1 to enable sharp frame done
         */
        uint32_t sharp_frame_int_ena:1;
        /** color_frame_int_ena : R/W; bitpos: [25]; default: 0;
         *  write 1 to enable color frame done
         */
        uint32_t color_frame_int_ena:1;
        /** yuv2rgb_frame_int_ena : R/W; bitpos: [26]; default: 0;
         *  write 1 to enable yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_ena:1;
        /** tail_idi_frame_int_ena : R/W; bitpos: [27]; default: 0;
         *  write 1 to enable isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_ena:1;
        /** header_idi_frame_int_ena : R/W; bitpos: [28]; default: 0;
         *  write 1 to enable real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_ena:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} isp_int_ena_reg_t;

/** Type of int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** isp_data_type_err_int_clr : WT; bitpos: [0]; default: 0;
         *  write 1 to clear input data type error
         */
        uint32_t isp_data_type_err_int_clr:1;
        /** isp_async_fifo_ovf_int_clr : WT; bitpos: [1]; default: 0;
         *  write 1 to clear isp input fifo overflow
         */
        uint32_t isp_async_fifo_ovf_int_clr:1;
        /** isp_buf_full_int_clr : WT; bitpos: [2]; default: 0;
         *  write 1 to clear isp input buffer full
         */
        uint32_t isp_buf_full_int_clr:1;
        /** isp_hvnum_setting_err_int_clr : WT; bitpos: [3]; default: 0;
         *  write 1 to clear hnum and vnum setting format error
         */
        uint32_t isp_hvnum_setting_err_int_clr:1;
        /** isp_data_type_setting_err_int_clr : WT; bitpos: [4]; default: 0;
         *  write 1 to clear setting invalid reg_data_type
         */
        uint32_t isp_data_type_setting_err_int_clr:1;
        /** isp_mipi_hnum_unmatch_int_clr : WT; bitpos: [5]; default: 0;
         *  write 1 to clear hnum setting unmatch with mipi input
         */
        uint32_t isp_mipi_hnum_unmatch_int_clr:1;
        /** dpc_check_done_int_clr : WT; bitpos: [6]; default: 0;
         *  write 1 to clear dpc check done
         */
        uint32_t dpc_check_done_int_clr:1;
        /** gamma_xcoord_err_int_clr : WT; bitpos: [7]; default: 0;
         *  write 1 to clear gamma setting error
         */
        uint32_t gamma_xcoord_err_int_clr:1;
        /** ae_monitor_int_clr : WT; bitpos: [8]; default: 0;
         *  write 1 to clear ae monitor
         */
        uint32_t ae_monitor_int_clr:1;
        /** ae_frame_done_int_clr : WT; bitpos: [9]; default: 0;
         *  write 1 to clear ae
         */
        uint32_t ae_frame_done_int_clr:1;
        /** af_fdone_int_clr : WT; bitpos: [10]; default: 0;
         *  write 1 to clear af statistic
         */
        uint32_t af_fdone_int_clr:1;
        /** af_env_int_clr : WT; bitpos: [11]; default: 0;
         *  write 1 to clear af monitor
         */
        uint32_t af_env_int_clr:1;
        /** awb_fdone_int_clr : WT; bitpos: [12]; default: 0;
         *  write 1 to clear awb
         */
        uint32_t awb_fdone_int_clr:1;
        /** hist_fdone_int_clr : WT; bitpos: [13]; default: 0;
         *  write 1 to clear histogram
         */
        uint32_t hist_fdone_int_clr:1;
        /** frame_int_clr : WT; bitpos: [14]; default: 0;
         *  write 1 to clear isp frame end
         */
        uint32_t frame_int_clr:1;
        /** blc_frame_int_clr : WT; bitpos: [15]; default: 0;
         *  write 1 to clear blc frame done
         */
        uint32_t blc_frame_int_clr:1;
        /** lsc_frame_int_clr : WT; bitpos: [16]; default: 0;
         *  write 1 to clear lsc frame done
         */
        uint32_t lsc_frame_int_clr:1;
        /** dpc_frame_int_clr : WT; bitpos: [17]; default: 0;
         *  write 1 to clear dpc frame done
         */
        uint32_t dpc_frame_int_clr:1;
        /** bf_frame_int_clr : WT; bitpos: [18]; default: 0;
         *  write 1 to clear bf frame done
         */
        uint32_t bf_frame_int_clr:1;
        /** demosaic_frame_int_clr : WT; bitpos: [19]; default: 0;
         *  write 1 to clear demosaic frame done
         */
        uint32_t demosaic_frame_int_clr:1;
        /** median_frame_int_clr : WT; bitpos: [20]; default: 0;
         *  write 1 to clear median frame done
         */
        uint32_t median_frame_int_clr:1;
        /** ccm_frame_int_clr : WT; bitpos: [21]; default: 0;
         *  write 1 to clear ccm frame done
         */
        uint32_t ccm_frame_int_clr:1;
        /** gamma_frame_int_clr : WT; bitpos: [22]; default: 0;
         *  write 1 to clear gamma frame done
         */
        uint32_t gamma_frame_int_clr:1;
        /** rgb2yuv_frame_int_clr : WT; bitpos: [23]; default: 0;
         *  write 1 to clear rgb2yuv frame done
         */
        uint32_t rgb2yuv_frame_int_clr:1;
        /** sharp_frame_int_clr : WT; bitpos: [24]; default: 0;
         *  write 1 to clear sharp frame done
         */
        uint32_t sharp_frame_int_clr:1;
        /** color_frame_int_clr : WT; bitpos: [25]; default: 0;
         *  write 1 to clear color frame done
         */
        uint32_t color_frame_int_clr:1;
        /** yuv2rgb_frame_int_clr : WT; bitpos: [26]; default: 0;
         *  write 1 to clear yuv2rgb frame done
         */
        uint32_t yuv2rgb_frame_int_clr:1;
        /** tail_idi_frame_int_clr : WT; bitpos: [27]; default: 0;
         *  write 1 to clear isp_tail idi frame_end
         */
        uint32_t tail_idi_frame_int_clr:1;
        /** header_idi_frame_int_clr : WT; bitpos: [28]; default: 0;
         *  write 1 to clear real input frame end of isp_input
         */
        uint32_t header_idi_frame_int_clr:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} isp_int_clr_reg_t;

