espressif/esp-idf/components/soc/esp32p4/include/soc/isp_struct.h
typedef struct {
    volatile isp_gamma_y1_reg_t gamma_y1;
    volatile isp_gamma_y2_reg_t gamma_y2;
    volatile isp_gamma_y3_reg_t gamma_y3;
    volatile isp_gamma_y4_reg_t gamma_y4;
} isp_gamma_y_reg_t;

typedef struct {
    volatile isp_gamma_x1_reg_t gamma_x1;
    volatile isp_gamma_x2_reg_t gamma_x2;
} isp_gamma_x_reg_t;

typedef struct {
    volatile isp_ver_date_reg_t ver_date;
    volatile isp_clk_en_reg_t clk_en;
    volatile isp_cntl_reg_t cntl;
    volatile isp_hsync_cnt_reg_t hsync_cnt;
    volatile isp_frame_cfg_reg_t frame_cfg;
    volatile isp_ccm_coef0_reg_t ccm_coef0;
    volatile isp_ccm_coef1_reg_t ccm_coef1;
    volatile isp_ccm_coef3_reg_t ccm_coef3;
    volatile isp_ccm_coef4_reg_t ccm_coef4;
    volatile isp_ccm_coef5_reg_t ccm_coef5;
    volatile isp_bf_matrix_ctrl_reg_t bf_matrix_ctrl;
    volatile isp_bf_sigma_reg_t bf_sigma;
    volatile isp_bf_gau0_reg_t bf_gau0;
    volatile isp_bf_gau1_reg_t bf_gau1;
    volatile isp_dpc_ctrl_reg_t dpc_ctrl;
    volatile isp_dpc_conf_reg_t dpc_conf;
    volatile isp_dpc_matrix_ctrl_reg_t dpc_matrix_ctrl;
    volatile isp_dpc_deadpix_cnt_reg_t dpc_deadpix_cnt;
    volatile isp_lut_cmd_reg_t lut_cmd;
    volatile isp_lut_wdata_reg_t lut_wdata;
    volatile isp_lut_rdata_reg_t lut_rdata;
    volatile isp_lsc_tablesize_reg_t lsc_tablesize;
    volatile isp_demosaic_matrix_ctrl_reg_t demosaic_matrix_ctrl;
    volatile isp_demosaic_grad_ratio_reg_t demosaic_grad_ratio;
    volatile isp_median_matrix_ctrl_reg_t median_matrix_ctrl;
    volatile isp_int_raw_reg_t int_raw;
    volatile isp_int_st_reg_t int_st;
    volatile isp_int_ena_reg_t int_ena;
    volatile isp_int_clr_reg_t int_clr;
    volatile isp_gamma_ctrl_reg_t gamma_ctrl;
    volatile isp_gamma_y_reg_t gamma_rgb_y[3]; // r: gamma_rgb_y[0], g: gamma_rgb_y[1], b: gamma_rgb_y[2]
    volatile isp_gamma_x_reg_t gamma_rgb_x[3]; // r: gamma_rgb_x[0], g: gamma_rgb_x[1], b: gamma_rgb_x[2]
    volatile isp_ae_ctrl_reg_t ae_ctrl;
    volatile isp_ae_monitor_reg_t ae_monitor;
    volatile isp_ae_bx_reg_t ae_bx;
    volatile isp_ae_by_reg_t ae_by;
    volatile isp_ae_winpixnum_reg_t ae_winpixnum;
    volatile isp_ae_win_reciprocal_reg_t ae_win_reciprocal;
    volatile isp_ae_block_mean_reg_t ae_block_mean[7];
    volatile isp_sharp_ctrl0_reg_t sharp_ctrl0;
    volatile isp_sharp_filter_reg_t sharp_filter[3];
    volatile isp_sharp_matrix_ctrl_reg_t sharp_matrix_ctrl;
    volatile isp_sharp_ctrl1_reg_t sharp_ctrl1;
    volatile isp_dma_cntl_reg_t dma_cntl;
    volatile isp_dma_raw_data_reg_t dma_raw_data;
    volatile isp_cam_cntl_reg_t cam_cntl;
    volatile isp_cam_conf_reg_t cam_conf;
    volatile isp_af_ctrl0_reg_t af_ctrl0;
    volatile isp_af_ctrl1_reg_t af_ctrl1;
    volatile isp_af_gen_th_ctrl_reg_t af_gen_th_ctrl;
    volatile isp_af_env_user_th_sum_reg_t af_env_user_th_sum;
    volatile isp_af_env_user_th_lum_reg_t af_env_user_th_lum;
    volatile isp_af_threshold_reg_t af_threshold;
    volatile isp_af_hscale_a_reg_t af_hscale_a;
    volatile isp_af_vscale_a_reg_t af_vscale_a;
    volatile isp_af_hscale_b_reg_t af_hscale_b;
    volatile isp_af_vscale_b_reg_t af_vscale_b;
    volatile isp_af_hscale_c_reg_t af_hscale_c;
    volatile isp_af_vscale_c_reg_t af_vscale_c;
    volatile isp_af_sum_a_reg_t af_sum_a;
    volatile isp_af_sum_b_reg_t af_sum_b;
    volatile isp_af_sum_c_reg_t af_sum_c;
    volatile isp_af_lum_a_reg_t af_lum_a;
    volatile isp_af_lum_b_reg_t af_lum_b;
    volatile isp_af_lum_c_reg_t af_lum_c;
    volatile isp_awb_mode_reg_t awb_mode;
    volatile isp_awb_hscale_reg_t awb_hscale;
    volatile isp_awb_vscale_reg_t awb_vscale;
    volatile isp_awb_th_lum_reg_t awb_th_lum;
    volatile isp_awb_th_rg_reg_t awb_th_rg;
    volatile isp_awb_th_bg_reg_t awb_th_bg;
    volatile isp_awb0_white_cnt_reg_t awb0_white_cnt;
    volatile isp_awb0_acc_r_reg_t awb0_acc_r;
    volatile isp_awb0_acc_g_reg_t awb0_acc_g;
    volatile isp_awb0_acc_b_reg_t awb0_acc_b;
    volatile isp_color_ctrl_reg_t color_ctrl;
    volatile isp_blc_value_reg_t blc_value;
    volatile isp_blc_ctrl0_reg_t blc_ctrl0;
    volatile isp_blc_ctrl1_reg_t blc_ctrl1;
    volatile isp_blc_ctrl2_reg_t blc_ctrl2;
    volatile isp_blc_mean_reg_t blc_mean;
    volatile isp_hist_mode_reg_t hist_mode;
    volatile isp_hist_coeff_reg_t hist_coeff;
    volatile isp_hist_offs_reg_t hist_offs;
    volatile isp_hist_size_reg_t hist_size;
    volatile isp_hist_seg0_reg_t hist_seg0;
    volatile isp_hist_seg1_reg_t hist_seg1;
    volatile isp_hist_seg2_reg_t hist_seg2;
    volatile isp_hist_seg3_reg_t hist_seg3;
    volatile isp_hist_weight0_reg_t hist_weight0;
    volatile isp_hist_weight1_reg_t hist_weight1;
    volatile isp_hist_weight2_reg_t hist_weight2;
    volatile isp_hist_weight3_reg_t hist_weight3;
    volatile isp_hist_weight4_reg_t hist_weight4;
    volatile isp_hist_weight5_reg_t hist_weight5;
    volatile isp_hist_weight6_reg_t hist_weight6;
    volatile isp_hist_binn_reg_t hist_binn[16];
    volatile isp_mem_aux_ctrl_0_reg_t mem_aux_ctrl_0;
    volatile isp_mem_aux_ctrl_1_reg_t mem_aux_ctrl_1;
    volatile isp_mem_aux_ctrl_2_reg_t mem_aux_ctrl_2;
    volatile isp_mem_aux_ctrl_3_reg_t mem_aux_ctrl_3;
    volatile isp_mem_aux_ctrl_4_reg_t mem_aux_ctrl_4;
    volatile isp_yuv_format_reg_t yuv_format;
    volatile isp_rdn_eco_cs_reg_t rdn_eco_cs;
    volatile isp_rdn_eco_low_reg_t rdn_eco_low;
    volatile isp_rdn_eco_high_reg_t rdn_eco_high;
} isp_dev_t;

extern isp_dev_t ISP;

#ifndef __cplusplus
_Static_assert(sizeof(isp_dev_t) == 0x244, "Invalid size of isp_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
